{
  "/create": [
    {
      "message": "Hi there! I'm Agent Mira, your home-buying consultant Lets's work together to craft the perfect offer for your dream home.",
      "Action": "",
      "option": []
    },
    {
      "message": "To get started, I need to know a little more about location. What's your address?",
      "Action": "input",
      "option": []
    },
    {
      "message": "we will consider the same in our offer. Now we'll dive into the next step: analyzing this property and the market to create your personalized offer!",
      "Action": "next",
      "option": ["presenting-comparable"]
    }
  ],

  "/create/presenting-comparable": [
    {
      "message": "Select a property below to remove from the comparable properties list.",
      "Action": "select",
      "option": [
        "abc, road, city, state, zip",
        "def, road, city, state, zip",
        "xyz, road, city, state, zip"
      ]
    },
    {
      "message": "Sounds good! I'll use this data to help craft your winnning offer.",
      "Action": "next",
      "option": ["analyzing-current-market"]
    }
  ],

  "/create/analyzing-current-market": [
    {
      "message": "Done! I've got the market insights ready. Let's take a look and see what they tell us abouttis property.",
      "Action": "select",
      "option": [
        "Show Price Trends",
        "Show Supply and Demand",
        "Show Market Type"
      ]
    },
    {
      "message": "These factors give us valuable insight into how to position you offer. Lets use this data to refine our pricing strategy!",
      "Action": "next",
      "option": ["property-condition"]
    }
  ],

  "/create/property-condition": [
    {
      "message": "Here is the overall quality score",
      "Action": "",
      "option": []
    },
    {
      "message": "Here are the damages of the property",
      "Action": "",
      "option": []
    },
    {
      "message": "Have you had a chance to see the property in person?",
      "Action": "select",
      "option": [
        "Yes, I have visited the property",
        "No, I haven't visited the property"
      ]
    },
    {
      "message": "These factors give us valuable insight into how to position your offer. Lets use this data to refine our price strategy!",
      "Action": "next",
      "option": ["personalizing-the-offer"]
    }
  ],
  "/create/personalizing-the-offer": [
    {
      "message": "Wow, I love seeing your inspiration! this really helps me understand you vision. Let's make sure this property aligns with it",
      "Action": "",
      "option": []
    },
    {
      "message": "Now that I undestand your dream home and priorities. I'll analyze how this property aligns with them and tailor your offer accordingly. Let's move forward",
      "Action": "next",
      "option": ["recommended-offer"]
    }
  ],
  "/create/recommended-offer": [
    {
      "message": "Thank you for sharing all the important information to help me design the best offer for your target property",
      "Action": "",
      "option": []
    },
    {
      "message": "Please take a moment to review this offer",
      "Action": "",
      "option": []
    },
    {
      "message": "Now would you like to customise your offer? How competitive would you like your offer to be?",
      "Action":"select",
      "option":[
        "Stay conservative",
        "Balance value & win",
        "Win this home"
      ]
    },
    {
      "message":"Great! You'll recieve confirmation shortly",
      "Action":"",
      "option":[]
    },
    {
      "message":"Meanwhile, I'll share these details with one of our expert real estate agents.They'll double check my analysis to ensure i haven't missed anything and cnfirm the final offer the with you soon",
      "Action":"",
      "option":[]
    },
    {
      "message":"Would you like to download a report with all the information we've discussed?",
      "Action":"select",
      "option":[
        "No, Thank you!",
        "Download"
      ]
    }
  ]
}
